app/views/container_stacks/_form.html.erb

    <select name="container_stack[language_id]">
      <% language = Language.all
---
SELECT `languages`.* FROM `languages`

    <select name="container_stack[compiler_id]">
      <% compiler = Compiler.all
---
SELECT `compilers`.* FROM `compilers`