app/views/container_stacks/index.html.erb

SELECT `languages`.* FROM `languages`
---
<%
   lang = Language.all

SELECT `compilers`.* FROM `compilers`
---

   comp = Compiler.all