app/views/compilers/_form.html.erb

    <select name="compiler[language_id]">
      <% language = Language.all
---
SELECT `languages`.* FROM `languages`