app/views/compilers/index.html.erb

<%
   lang = Language.all
---
SELECT `languages`.* FROM `languages`