app/controllers/compilers_controller.rb

SELECT `compilers`.* FROM `compilers`
---
  def index
    @compilers = Compiler.all

SELECT `compilers`.* FROM `compilers` WHERE `compilers`.`id` = 1 LIMIT 1
---
  def show
    @compiler = Compiler.find(params[:id])

SELECT `compilers`.* FROM `compilers` WHERE `compilers`.`id` = 1 LIMIT 1
---
  def edit
    @compiler = Compiler.find(params[:id])

INSERT INTO `compilers` (`created_at`, `description`, `image_id`, `language_id`, `name`, `run_config`, `updated_at`) VALUES ('2016-10-08 11:24:38', 'Java 7 Api', 'java_7', NULL, 'Java 7', 'javac <filename> && java <filename>', '2016-10-08 11:24:38')
---
  def create
    @compiler = Compiler.new(params[:compiler])

    respond_to do |format|
      if @compiler.save

SELECT `compilers`.* FROM `compilers` WHERE `compilers`.`id` = 1 LIMIT 1
UPDATE `compilers` SET `language_id` = 1, `updated_at` = '2016-10-08 11:28:11' WHERE `compilers`.`id` = 1
---
  def update
    @compiler = Compiler.find(params[:id])

    respond_to do |format|
      if @compiler.update_attributes(params[:compiler])