app/controllers/contents_controller.rb

  def index
    if(params[:uid].present? || params[:cli].present?)
      if(params[:cli].present?)
        user = current_user
      else
        user = User.find_by_unique_key(params[:uid])
      end
      if(user.present?)
        @contents = Content.find(:all, :conditions => ["user_id = ?", user.id])
        if(params[:temp].present?)
          templates = Content.find(:all, :conditions => ["template = ?", Content::TEMPLATE_AL])
          templates += Content.find(:all, :conditions => ["template = ? and user_id = ?", Content::TEMPLATE_USER, user.id])
          @contents = templates
        else
          templates = Content.find(:all, :conditions => ["template = ?", Content::TEMPLATE_AL])
          @contents += templates
        end
      end
    else
      @contents = Content.all
---
SELECT `users`.* FROM `users` WHERE `users`.`unique_key` = 'Dv9j141Zfpy3DjBoCeP0' LIMIT 1
SELECT `contents`.* FROM `contents` WHERE (template = 10)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `contents`.* FROM `contents`

  def create
    @content = Content.new()
    @content.user_id = current_user.id
    @content.name = params[:name]
    @content.desc = params[:desc]
    @content.content = params[:content]
    @content.file_type = params[:file_type].to_i
    @content.compile = params[:compile].to_i
    @content.status = params[:status].to_i
    @content.sharability = params[:sharability].to_i
    @content.template = params[:template].to_i if(params[:template].present? && (params[:template].to_i != -10))
    @content.folder_id = params[:folder_id].to_i if(params[:folder_id].present?)
    if(params[:tempname].present?)
      temp = Content.find(:first, :conditions => ["template = ? and user_id = ? and name = ?", Content::TEMPLATE_USER, current_user.id, params[:tempname]])
      if(temp.nil?)
        temp = Content.find(:first, :conditions => ["template = ? and name = ?", Content::TEMPLATE_AL, params[:tempname]])
      end
      if(!temp.nil?)
        @content.content = temp.content
      end
    end
    respond_to do |format|
      if(@content.save)
        current_user.last_open_file = @content.id
        current_user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `contents` (`compile`, `content`, `created_at`, `desc`, `name`, `sharability`, `status`, `type`, `updated_at`, `user_id`) VALUES (NULL, NULL, '2014-06-02 16:25:05', NULL, NULL, NULL, NULL, NULL, '2014-06-02 16:25:05', NULL)
UPDATE `users` SET `last_open_file` = 22, `updated_at` = '2014-06-02 16:51:25' WHERE `users`.`id` = 1

  def update
    @content = Content.find(params[:id])
    @content.user_id = current_user.id
    @content.name = params[:name]
    @content.desc = params[:desc]
    @content.content = params[:content]
    @content.file_type = params[:file_type].to_i
    @content.compile = params[:compile].to_i
    @content.status = params[:status].to_i if(params[:status].present?)
    @content.sharability = params[:sharability].to_i
    @content.template = params[:template].to_i if(params[:template].present? && (params[:template].to_i != -10))
    @content.folder_id = params[:folder_id].to_i if(params[:folder_id].present?)
    respond_to do |format|
      if(@content.save)
---
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` = 28 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `contents` SET `name` = 'New Note sdfsdffasdf', `updated_at` = '2014-06-02 20:34:44' WHERE `contents`.`id` = 29
UPDATE `users` SET `last_open_file` = 28, `updated_at` = '2014-06-02 20:45:47' WHERE `users`.`id` = 1

  def destroy
    if(current_user.last_open_file == params[:id].to_i)
      current_user.last_open_file = nil
      current_user.save
    end
    @content = Content.find(params[:id])
    @content.destroy
---
UPDATE `users` SET `last_open_file` = NULL, `updated_at` = '2014-06-02 20:10:46' WHERE `users`.`id` = 1
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` = 12 LIMIT 1
DELETE FROM `contents` WHERE `contents`.`id` = 12