app/controllers/containers_controller.rb

  def index
    @containers = Container.all
---
SELECT `containers`.* FROM `containers`