app/controllers/container_stacks_controller.rb

  def index
    @container_stacks = ContainerStack.all
---
SELECT `container_stacks`.* FROM `container_stacks`

  def show
    @container_stack = ContainerStack.find(params[:id])
---
SELECT `container_stacks`.* FROM `container_stacks` WHERE `container_stacks`.`id` = 1 LIMIT 1

  def create
    @container_stack = ContainerStack.new(params[:container_stack])

    respond_to do |format|
      if @container_stack.save
---
INSERT INTO `container_stacks` (`compiler_id`, `count`, `created_at`, `created_by`, `dependency`, `image_id`, `image_type`, `language_id`, `name`, `status`, `updated_at`) VALUES (1, 3, '2016-10-08 11:42:34', -1, '', 'java 7', 0, 1, 'java 7 stack', 0, '2016-10-08 11:42:34')