app/controllers/folders_controller.rb

  def index
    if(params[:uid].present?)
      user = User.find_by_unique_key(params[:uid])
      if(user.present?)
        @folders = Folder.find(:all, :conditions => ["user_id = ?", user.id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1