app/controllers/home_controller.rb

  def homepage
    if(current_user.present?)
      if(!current_user.unique_key.present?)
        current_user.set_unique_key
      end
      if(current_user.last_open_file.present?)
        if(params[:file].present?)
          current_user.last_open_file = params[:file].to_i
          current_user.save
        end
        @file = Content.find(current_user.last_open_file)
---
UPDATE `users` SET `last_sign_in_at` = '2014-05-24 22:57:02', `current_sign_in_at` = '2014-05-26 19:35:21', `sign_in_count` = 14, `updated_at` = '2014-05-26 19:35:21' WHERE `users`.`id` = 1
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` = 15 LIMIT 1

  def set_default_user_editor_setting
    if(current_user.present?)
      if(params[:keybind].present?)
        current_user.default_keybind = params[:keybind].to_i
      end
      if(params[:fontsize].present?)
        current_user.default_font_size = params[:fontsize].to_i
      end
      if(params[:theme].present?)
        current_user.default_theme = params[:theme].to_i
      end
      if(current_user.save)
---
UPDATE `users` SET `last_open_file` = 15, `updated_at` = '2014-05-24 22:43:34' WHERE `users`.`id` = 1

  def profile
    @user = User.find(:first, :conditions => ["email like ?", "#{params[:uid]}%"])
---
SELECT `users`.* FROM `users` WHERE (url_name = 'package' or unique_key = 'package') LIMIT 1

  def content_public
    @user = User.find(:first, :conditions => ["email like ?", "#{params[:uid]}%"])
---
SELECT `users`.* FROM `users` WHERE (url_name = 'assets' or unique_key = 'assets') LIMIT 1

  def set_template_cat
    content = Content.find(params[:id])
    content.template_cat = params[:cat].to_i
    content.save
---
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` = 15 LIMIT 1
UPDATE `contents` SET `name` = 'Rishabh', `content` = 'Rishabh Tripathi Blog<br>sdfa <br>', `updated_at` = '2014-05-25 07:25:46' WHERE `contents`.`id` = 15